--MisDescBegin
--脚本号
x229004_g_ScriptId = 229004

--接受任务NPC属性
x229004_g_Position_X=95.9574
x229004_g_Position_Z=88.6181
x229004_g_SceneID=13
x229004_g_AccomplishNPC_Name="本凡"

--前提任务
--g_MissionIdPre =

--任务目标npc
x229004_g_Name	= "本凡"

--任务号
x229004_g_MissionId = 1080

--任务归类
x229004_g_MissionKind = 24

--任务等级
x229004_g_MissionLevel = 10000

--是否是精英任务
x229004_g_IfMissionElite = 0

--下面几项是动态显示的内容，用于在任务列表中动态显示任务情况**********************
--任务是否已经完成
x229004_g_IsMissionOkFail = 0		--变量的第0位

--以上是动态**************************************************************

--任务变量第一位用来存储随机得到的脚本号

--任务文本描述
x229004_g_MissionName="师门任务"
x229004_g_MissionInfo=""  --任务描述
x229004_g_MissionTarget = "%f"
x229004_g_ContinueInfo="干得不错"		--未完成任务的npc对话
x229004_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x229004_g_MissionRound=17

x229004_g_DoubleExp = 48
x229004_g_AccomplishCircumstance = 1

x229004_g_ShimenTypeIndex = 1
x229004_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x229004_g_Parameter_Item_IDRandom={{id=6,num=5}}
x229004_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}

--用来保存字符串格式化的数据
x229004_g_FormatList = {
								"好久没有见#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#W#r  你可以在天龙寺找到#R破嗔#W#{_INFOAIM99,120,13,破嗔}，请他把你送往各大城市。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#W#r  你可以在天龙寺找到#R破嗔#W#{_INFOAIM99,120,13,破嗔}，请他把你送往各大城市。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"#G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#W#r  你可以在天龙寺找到#R破嗔#W#{_INFOAIM99,120,13,破嗔}，请他把你送往各大城市。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"请你在天龙寺#G%s#W找到#G%s#W，在它附近使用#Y%s#W来试炼你的能力。#r  #G小提示：#W#r  当你来到要求试炼的铜人附近时，你可以按#GAlt+A#W可以打开物品栏，点击#G“任务”#W页面就可以打开任务物品栏，右键点击#Y医用金针#W，就可以完成试炼了。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"请你去找到#R%s#W， 他会带你去挑战#G%s#W的。#r  #G小提示：#W#r  本相大师就在天龙寺#{_INFOAIM35,86,13,本相}。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"请你帮我抓一只#G%p#W来。#B#r  #G小提示：#W#r  天龙寺的破嗔#{_INFOAIM99,120,13,破嗔}可以送你去玄武岛，而玄武岛有一条小路通往圣兽山。你可以在玄武岛或者圣兽山上捕捉我需要的珍兽。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"请你在天龙寺中四处看看，帮我找来5个#G%s#W。#r  #G小提示：#W#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#W#r  伍忠大人就在天龙寺#{_INFOAIM94,126,13,伍忠}。#r  林国清大人就在天龙寺#{_INFOAIM96,126,13,林国清}。#r  齐归蝶夫人就在天龙寺#{_INFOAIM154,115,13,齐归蝶}。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
								"去杀死#G%s%s#W个#G%n#W。#{SMXL_090819_dali}#r#{SMRW_090206_01}",
							}


--格式字符串中的索引, 表示从4开始,后多少位视SetMissionByIndex(...)的多少而定
x229004_g_StrForePart=4

x229004_g_StrList = {
						"医用金针",
						"经脉铜人区",
						"经脉铜人区",
						"经脉铜人区",
						"经脉铜人区",
						"本相",
						"塔底副本",
						"满月",
						"眼儿媚",
						"红妆素裹",
						"伍忠",
						"林国清",
						"齐归蝶",
						"野生柴猫",
						"手太阴肺经铜人",
						"手阳明肠经铜人",
						"足阳明胃经铜人",
						"足太阴脾经铜人",
						"0",
						"1",
						"2",
						"3",
						"4",
						"5",
						"6",
						"7",
						"8",
						"9",
						}

--MisDescEnd
