--MisDescBegin
--脚本号
x229003_g_ScriptId = 229003

--接受任务NPC属性
x229003_g_Position_X=95.9834
x229003_g_Position_Z=86.7892
x229003_g_SceneID=15
x229003_g_AccomplishNPC_Name="孟龙"

--前提任务
--g_MissionIdPre =

--任务目标npc
x229003_g_Name	= "孟龙"

--任务号
x229003_g_MissionId = 1090

--任务归类
x229003_g_MissionKind = 26

--任务等级
x229003_g_MissionLevel = 10000

--是否是精英任务
x229003_g_IfMissionElite = 0

--下面几项是动态显示的内容，用于在任务列表中动态显示任务情况**********************
--任务是否已经完成
x229003_g_IsMissionOkFail = 0		--变量的第0位

--以上是动态**************************************************************

--任务变量第一位用来存储随机得到的脚本号

--任务文本描述
x229003_g_MissionName="师门任务"
x229003_g_MissionInfo=""  --任务描述
x229003_g_MissionTarget = "%f"
x229003_g_ContinueInfo="干得不错"		--未完成任务的npc对话
x229003_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x229003_g_MissionRound=17
x229003_g_DoubleExp = 48
x229003_g_AccomplishCircumstance = 1

x229003_g_ShimenTypeIndex = 1
x229003_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x229003_g_Parameter_Item_IDRandom={{id=6,num=5}}
x229003_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}

--用来保存字符串格式化的数据
x229003_g_FormatList = {
								"好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#W#r  你可以在峨眉山找到#R杨四娘#W#{_INFOAIM86,142,15,杨四娘}，请他把你送往各大城市。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#W#r  你可以在峨眉山找到#R杨四娘#W#{_INFOAIM86,142,15,杨四娘}，请他把你送往各大城市。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"#G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#W#r  你可以在峨眉山找到#R杨四娘#W#{_INFOAIM86,142,15,杨四娘}，请他把你送往各大城市。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"请你在峨眉山#G%s#W找到#G%s#W，使用#Y%s#W来喂养它。#r  #G小提示：#W#r  当你来到需要喂养的凤凰附近时，你可以按#GAlt+A#W可以打开物品栏，点击#G“任务”#W页面就可以打开任务物品栏，右键点击#Y峨嵋仙露#W，就可以完成喂养了。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"请你去找到#R%s#W， 他会带你去挑战#G%s#W的。#r  #G小提示：#W#r  孟青青掌门就在峨眉山#{_INFOAIM96,73,15,孟青青}。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"请你帮我抓一只#G%p#W来。#B#r  #G小提示：#W#r  #G峨眉山#W的杨四娘#{_INFOAIM86,142,15,杨四娘}可以送你去玄武岛，而玄武岛有一条小路通往圣兽山。你可以在玄武岛或者圣兽山上捕捉我需要的珍兽。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"请你在峨眉山上四处看看，帮我找来5个#G%s#W。#r  #G小提示：#W#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#r  你可以在#R小黄猴#W身上找到#Y遗失的首饰#W。#r  你可以在#R小黑猴#W身上找到#Y遗失的祭品#W。#r  你可以在#R小白猴#W身上找到#Y遗失的珠宝#W。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#W#r  桃花仙就在峨眉山#{_INFOAIM156,99,15,桃花仙}。#r  桃叶仙就在峨眉山#{_INFOAIM156,112,15,桃叶仙}。#r  桃枝仙就在峨眉山#{_INFOAIM156,106,15,桃枝仙}。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								"去杀死#G%s%s#W个#G%n#W。#{SMXL_090819_emei}#r#{SMRW_090206_01}",
								}


--格式字符串中的索引, 表示从4开始,后多少位视SetMissionByIndex(...)的多少而定
x229003_g_StrForePart=4

x229003_g_StrList = {
						"峨嵋仙露",
						"珙椿晓雨",
						"白水秋风",
						"私语台",
						"长生殿",
						"孟青青",
						"桃花阵副本",
						"遗失的首饰",
						"遗失的祭品",
						"遗失的珠宝",
						"桃花仙",
						"桃叶仙",
						"桃枝仙",
						"野生柴猫",
						"金顶凤凰",
						"灵泉凤凰",
						"佛光凤凰",
						"万年凤凰",
						"0",
						"1",
						"2",
						"3",
						"4",
						"5",
						"6",
						"7",
						"8",
						"9",
						}

--MisDescEnd
