--MisDescBegin
--脚本号
x229000_g_ScriptId = 229000

--接受任务NPC属性
x229000_g_Position_X=96.0000
x229000_g_Position_Z=82.0000
x229000_g_SceneID=9
x229000_g_AccomplishNPC_Name="慧方"

--前提任务
--g_MissionIdPre =

--任务目标npc
x229000_g_Name	= "慧方"

--任务号
x229000_g_MissionId = 1060

--任务归类
x229000_g_MissionKind = 20

--任务等级
x229000_g_MissionLevel = 10000

--是否是精英任务
x229000_g_IfMissionElite = 0

--下面几项是动态显示的内容，用于在任务列表中动态显示任务情况**********************
--任务是否已经完成
x229000_g_IsMissionOkFail = 0		--变量的第0位

--以上是动态**************************************************************

--任务变量第一位用来存储随机得到的脚本号

--任务文本描述
x229000_g_MissionName="师门任务"
x229000_g_MissionInfo=""  --任务描述
x229000_g_MissionTarget = "%f"
x229000_g_ContinueInfo="干得不错"		--未完成任务的npc对话
x229000_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x229000_g_MissionRound=17

x229000_g_DoubleExp = 48
x229000_g_AccomplishCircumstance = 1

x229000_g_ShimenTypeIndex = 1
x229000_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x229000_g_Parameter_Item_IDRandom={{id=6,num=5}}
x229000_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}

--用来保存字符串格式化的数据
x229000_g_FormatList = {
								"好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#W#r  你可以在少林寺找到#R慧轮#W#{_INFOAIM92,132,9,慧轮}，请他把你送往各大城市。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#W#r  你可以在少林寺找到#R慧轮#W#{_INFOAIM92,132,9,慧轮}，请他把你送往各大城市。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"#G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#W#r  你可以在少林寺找到#R慧轮#W#{_INFOAIM92,132,9,慧轮}，请他把你送往各大城市。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"请你使用#Y%s#W，打扫少林寺#G%s#W的#G%s#W。#r  #G小提示：#W#r  当你来到需要打扫的院子时，你可以按#GAlt+A#W可以打开物品栏，点击#G“任务”#W页面就可以打开任务物品栏，右键点击#Y大扫帚#W，就可以完成打扫了。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"请你去找到#R%s#W， 他会带你去挑战#G%s#W的。#r  #G小提示：#W#r  玄澄大师就在少林寺#{_INFOAIM61,62,9,玄澄}。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"请你帮我抓一只#G%p#W来。#B#r  #G小提示：#W#r  #G少林寺的慧轮#{_INFOAIM92,132,9,慧轮}可以送你去玄武岛，而玄武岛有一条小路通往圣兽山。你可以在玄武岛或者圣兽山上捕捉我需要的珍兽。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"请你在少林寺内四处看看，帮我找来5个#G%s#W。#r  #G小提示：#W#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#W#r  潘玄耕师兄就在少林寺{_INFOAIM70,105,9,潘玄耕}。#r  卫玄望就在少林寺{_INFOAIM61,57,9,卫玄望}。#r  方玄劳师兄就在少林寺{_INFOAIM123,88,9,方玄劳}。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"不错... ... 你一直为本门的发扬光大在尽心尽力的做着工作，我再额外给你一个任务吧，%s刚给我飞鸽传书，说他们需要帮忙，你去找一下%s的%s，他会安排你的任务的。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
								"去杀死#G%s%s#W个#G%n#W。#{SMXL_090819_shaolin}#r#{SMRW_090206_01}",
							}


--格式字符串中的索引, 表示从4开始,后多少位视SetMissionByIndex(...)的多少而定
x229000_g_StrForePart=4
x229000_g_ShimenPet_Index = 1

x229000_g_StrList = {
						"大扫帚",
						"大雄宝殿",
						"藏经阁",
						"山门",
						"钟楼",
						"玄澄",
						"塔林副本",
						"散落的柴火",
						"散落的蘑菇",
						"散落的松果",
						"潘玄耕",
						"卫玄望",
						"方玄劳",
						"野生柴猫",
						"地面",
						"本相",
						"孟青青",
						"佛印",
						"方腊",
						"菊剑",
						"林灵素",
						"冯阿三",
						"红玉",
						"塔底副本",
						"桃花阵副本",
						"酒窖副本",
						"光明洞副本",
						"折梅峰副本",
						"灵性峰副",
						"谷底副本",
						"五神洞副本",
						"少林",
						"天龙",
						"峨嵋",
						"丐帮",
						"明教",
						"天山",
						"武当",
						"逍遥",
						"星宿",
						"0",
						"1",
						"2",
						"3",
						"4",
						"5",
						"6",
						"7",
						"8",
						"9",
						}


--MisDescEnd
