--***********************************************************************************************************************************************
--2022Q3时装团购
--模型预览界面
--***********************************************************************************************************************************************
local g_UnifiedPosition

local objCared = -1
local targetId = -1

--***********************************************************************************************************************************************
-- PreLoad
--************************************************************************************************************************************************
function TuanGouClothes_PreLoad()
	this:RegisterEvent("OPEN_TUANGOUCLOTHES")
	this:RegisterEvent("ADJEST_UI_POS",false)
	this:RegisterEvent("VIEW_RESOLUTION_CHANGED",false)
	this:RegisterEvent("HIDE_ON_SCENE_TRANSED",false)
end

--***********************************************************************************************************************************************
-- OnLoad
--************************************************************************************************************************************************
function TuanGouClothes_OnLoad()
	g_UnifiedPosition=TuanGouClothes_Frame:GetProperty("UnifiedPosition")
end

--***********************************************************************************************************************************************
-- 事件响应函数
--************************************************************************************************************************************************
function TuanGouClothes_OnEvent(event)
	if (event  == "OPEN_TUANGOUCLOTHES") then
		targetId = tonumber(arg0)
		objCared = DataPool : GetNPCIDByServerID(tonumber(targetId))
		if objCared == nil or objCared == -1 then
			return
		end
		this:CareObject(objCared, 1, "TuanGouClothes")
		this:Show()
	elseif (event == "ADJEST_UI_POS") then
		TuanGouClothes_ResetPos()
	elseif (event == "VIEW_RESOLUTION_CHANGED") then
		TuanGouClothes_ResetPos()
	elseif (event == "HIDE_ON_SCENE_TRANSED") then
		TuanGouClothes_Close()
	end
end

--***********************************************************************************************************************************************
-- 重置位置
--************************************************************************************************************************************************
function TuanGouClothes_ResetPos()
  TuanGouClothes_Frame:SetProperty("UnifiedPosition", g_UnifiedPosition)
end

--***********************************************************************************************************************************************
-- 清数据
--***********************************************************************************************************************************************
function TuanGouClothes_OnHiden()
	--取消关心
	this:CareObject(objCared, 0, "TuanGouClothes")
	--关睜时装预览
	PushEvent("CLOSE_DRESSPREVIEW") 
	PushEvent( "CLOSE_GEMEFFECTPREVIEW")
end

--***********************************************************************************************************************************************
-- 关界面
--***********************************************************************************************************************************************
function TuanGouClothes_Close()
	--数据清繝
	TuanGouClothes_OnHiden()
	--隐藏界面
	this:Hide()
end

--***********************************************************************************************************************************************
-- 时装预览
--***********************************************************************************************************************************************
function TuanGouClothes_OnPreviewClick()
	PushEvent("OPEN_DRESSPREVIEW", 10125293, 76, 48) --??\??\??
end
